OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f87k22.h
#define _EBRT0_ON_7L            0xFE    // Enabled.
#define _EBRT0_OFF_7L           0xFF    // Disabled.
#define _EBRT1_ON_7L            0xFD    // Enabled.
#define _EBRT1_OFF_7L           0xFF    // Disabled.
#define _EBRT2_ON_7L            0xFB    // Enabled.
#define _EBRT2_OFF_7L           0xFF    // Disabled.
#define _EBRT3_ON_7L            0xF7    // Enabled.
#define _EBRT3_OFF_7L           0xFF    // Disabled.
#define _EBRT4_ON_7L            0xEF    // Enabled.
#define _EBRT4_OFF_7L           0xFF    // Disabled.
#define _EBRT5_ON_7L            0xDF    // Enabled.
#define _EBRT5_OFF_7L           0xFF    // Disabled.
#define _EBRT6_ON_7L            0xBF    // Enabled.
#define _EBRT6_OFF_7L           0xFF    // Disabled.
#define _EBRT7_ON_7L            0x7F    // Enabled.
#define _EBRT7_OFF_7L           0xFF    // Disabled.

//----------------------------- CONFIG7H Options -------------------------------

#define _EBRTB_ON_7H            0xBF    // Enabled.
#define _EBRTB_OFF_7H           0xFF    // Disabled.

//==============================================================================

#define __DEVID1                0x3FFFFE
#define __DEVID2                0x3FFFFF

#define __IDLOC0                0x200000
#define __IDLOC1                0x200001
#define __IDLOC2                0x200002
#define __IDLOC3                0x200003
#define __IDLOC4                0x200004
#define __IDLOC5                0x200005
#define __IDLOC6                0x200006
#define __IDLOC7                0x200007

#endif // #ifndef __PIC18F87K22_H__
